g/h/Cat.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Notes on Category Theory</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-10-09 Wed"/>
<meta name="author" content="GW Dean"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Notes on Category Theory</h1>

<p>The following notes are adapted from Lawvere and Schanuel's <i>Conceptual Mathematics</i>.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Sets. Maps. Composition. </a>
<ul>
<li><a href="#sec-1.1">1.1 Overview </a>
<ul>
<li><a href="#sec-1.1.1">1.1.1 Guide </a></li>
<li><a href="#sec-1.1.2">1.1.2 Summary: Definition of a Category </a></li>
</ul>
</li>
<li><a href="#sec-1.2">1.2 Definition: Point </a></li>
<li><a href="#sec-1.3">1.3 Definition: Category </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Isomorphisms. </a>
<ul>
<li><a href="#sec-2.1">2.1 Overview </a>
<ul>
<li><a href="#sec-2.1.1">2.1.1 Isomorphisms </a></li>
<li><a href="#sec-2.1.2">2.1.2 General Division Problems: Determination and Choice </a></li>
<li><a href="#sec-2.1.3">2.1.3 Retractions, Sections and Idempotents </a></li>
<li><a href="#sec-2.1.4">2.1.4 Isomorphisms and Automorphisms </a></li>
<li><a href="#sec-2.1.5">2.1.5 Guide </a></li>
<li><a href="#sec-2.1.6">2.1.6 Summary: Special Properties a Map May Have </a></li>
</ul>
</li>
<li><a href="#sec-2.2">2.2 Definition: Isomorphism </a></li>
<li><a href="#sec-2.3">2.3 Definition: Retraction </a></li>
<li><a href="#sec-2.4">2.4 Definition: Section </a></li>
<li><a href="#sec-2.5">2.5 Proposition 1 </a></li>
<li><a href="#sec-2.6">2.6 Proposition 2 </a></li>
<li><a href="#sec-2.7">2.7 Definition: Injective </a></li>
<li><a href="#sec-2.8">2.8 Definition: Monomorphism </a></li>
<li><a href="#sec-2.9">2.9 Definition: Epimorphism </a></li>
<li><a href="#sec-2.10">2.10 Proposition 3 </a></li>
<li><a href="#sec-2.11">2.11 Definition: Idempotent </a></li>
<li><a href="#sec-2.12">2.12 Theorem (uniqueness of inverses) </a></li>
<li><a href="#sec-2.13">2.13 Definition: Isomorphism </a></li>
<li><a href="#sec-2.14">2.14 Definition: Automorphism </a></li>
<li><a href="#sec-2.15">2.15 Summary: Special properties a map f:A-&gt;B may have. </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Examples of Categories. </a>
<ul>
<li><a href="#sec-3.1">3.1 Overview </a>
<ul>
<li><a href="#sec-3.1.1">3.1.1 The Category END of Endomaps of Sets </a></li>
<li><a href="#sec-3.1.2">3.1.2 Typical Applications of END </a></li>
<li><a href="#sec-3.1.3">3.1.3 Two Subcategories of END </a></li>
<li><a href="#sec-3.1.4">3.1.4 Categories of Endomaps </a></li>
<li><a href="#sec-3.1.5">3.1.5 Irreflexive Graphs </a></li>
<li><a href="#sec-3.1.6">3.1.6 Endomaps as Special Graphs </a></li>
<li><a href="#sec-3.1.7">3.1.7 The Simpler Category SGL: Objects Are Just Maps of Sets </a></li>
<li><a href="#sec-3.1.8">3.1.8 Reflexive Graphs </a></li>
<li><a href="#sec-3.1.9">3.1.9 Summary of the Examples and Their General Significance </a></li>
<li><a href="#sec-3.1.10">3.1.10 Retractions and Injectivity </a></li>
<li><a href="#sec-3.1.11">3.1.11 Types of Structure </a></li>
<li><a href="#sec-3.1.12">3.1.12 Guide </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 Universal Mapping Properties. </a>
<ul>
<li><a href="#sec-4.1">4.1 Overview </a>
<ul>
<li><a href="#sec-4.1.1">4.1.1 Terminal Objects </a></li>
<li><a href="#sec-4.1.2">4.1.2 Separating </a></li>
<li><a href="#sec-4.1.3">4.1.3 Initial Object </a></li>
<li><a href="#sec-4.1.4">4.1.4 Products </a></li>
<li><a href="#sec-4.1.5">4.1.5 Commutative, Associative, and Identity Laws for Multiplication of Objects </a></li>
<li><a href="#sec-4.1.6">4.1.6 Sums </a></li>
<li><a href="#sec-4.1.7">4.1.7 Distributive Laws </a></li>
<li><a href="#sec-4.1.8">4.1.8 Guide </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Map Objects. </a>
<ul>
<li><a href="#sec-5.1">5.1 Overview </a>
<ul>
<li><a href="#sec-5.1.1">5.1.1 Definition of Map Object </a></li>
<li><a href="#sec-5.1.2">5.1.2 Distributivity </a></li>
<li><a href="#sec-5.1.3">5.1.3 Map Objects and the Diagonal Argument </a></li>
<li><a href="#sec-5.1.4">5.1.4 Universal Properties and 'Observables' </a></li>
<li><a href="#sec-5.1.5">5.1.5 Guide </a></li>
<li><a href="#sec-5.1.6">5.1.6 Definition: Map Object </a></li>
<li><a href="#sec-5.1.7">5.1.7 Notation </a></li>
<li><a href="#sec-5.1.8">5.1.8 Proposition </a></li>
<li><a href="#sec-5.1.9">5.1.9 Theorem (Cantor's Diagonal Argument) </a></li>
<li><a href="#sec-5.1.10">5.1.10 Definition: Chaotic </a></li>
<li><a href="#sec-5.1.11">5.1.11 Definition: Admissible Notion </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Sets. Maps. Composition. </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Overview </h3>
<div class="outline-text-3" id="text-1.1">


</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> Guide </h4>
<div class="outline-text-4" id="text-1.1.1">

</div>

</div>

<div id="outline-container-1.1.2" class="outline-4">
<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> Summary: Definition of a Category </h4>
<div class="outline-text-4" id="text-1.1.2">

</div>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Definition: Point </h3>
<div class="outline-text-3" id="text-1.2">

<p>A <b>point</b> of a set X is a map <b>1</b>-&gt;X.
</p></div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Definition: Category </h3>
<div class="outline-text-3" id="text-1.3">

<p>A <b>CATEGORY</b> consists of the DATA:
</p><ul>
<li>
(1) Objects 
</li>
<li>
(2) Maps 
</li>
<li>
(3) Domain and Codomain
</li>
<li>
(4) Identity Map
</li>
<li>
(5) Composite Map

</li>
</ul>

<p>Satisfying the following RULES:
</p><ul>
<li>
(i)  Identity Laws
</li>
<li>
(ii) Associative Law

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Isomorphisms. </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Overview </h3>
<div class="outline-text-3" id="text-2.1">


</div>

<div id="outline-container-2.1.1" class="outline-4">
<h4 id="sec-2.1.1"><span class="section-number-4">2.1.1</span> Isomorphisms </h4>
<div class="outline-text-4" id="text-2.1.1">

</div>

</div>

<div id="outline-container-2.1.2" class="outline-4">
<h4 id="sec-2.1.2"><span class="section-number-4">2.1.2</span> General Division Problems: Determination and Choice </h4>
<div class="outline-text-4" id="text-2.1.2">

</div>

</div>

<div id="outline-container-2.1.3" class="outline-4">
<h4 id="sec-2.1.3"><span class="section-number-4">2.1.3</span> Retractions, Sections and Idempotents </h4>
<div class="outline-text-4" id="text-2.1.3">

</div>

</div>

<div id="outline-container-2.1.4" class="outline-4">
<h4 id="sec-2.1.4"><span class="section-number-4">2.1.4</span> Isomorphisms and Automorphisms </h4>
<div class="outline-text-4" id="text-2.1.4">

</div>

</div>

<div id="outline-container-2.1.5" class="outline-4">
<h4 id="sec-2.1.5"><span class="section-number-4">2.1.5</span> Guide </h4>
<div class="outline-text-4" id="text-2.1.5">

</div>

</div>

<div id="outline-container-2.1.6" class="outline-4">
<h4 id="sec-2.1.6"><span class="section-number-4">2.1.6</span> Summary: Special Properties a Map May Have </h4>
<div class="outline-text-4" id="text-2.1.6">

</div>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> Definition: Isomorphism </h3>
<div class="outline-text-3" id="text-2.2">

</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> Definition: Retraction </h3>
<div class="outline-text-3" id="text-2.3">

</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> Definition: Section </h3>
<div class="outline-text-3" id="text-2.4">

</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5"><span class="section-number-3">2.5</span> Proposition 1 </h3>
<div class="outline-text-3" id="text-2.5">

</div>

</div>

<div id="outline-container-2.6" class="outline-3">
<h3 id="sec-2.6"><span class="section-number-3">2.6</span> Proposition 2 </h3>
<div class="outline-text-3" id="text-2.6">

</div>

</div>

<div id="outline-container-2.7" class="outline-3">
<h3 id="sec-2.7"><span class="section-number-3">2.7</span> Definition: Injective </h3>
<div class="outline-text-3" id="text-2.7">

</div>

</div>

<div id="outline-container-2.8" class="outline-3">
<h3 id="sec-2.8"><span class="section-number-3">2.8</span> Definition: Monomorphism </h3>
<div class="outline-text-3" id="text-2.8">

</div>

</div>

<div id="outline-container-2.9" class="outline-3">
<h3 id="sec-2.9"><span class="section-number-3">2.9</span> Definition: Epimorphism </h3>
<div class="outline-text-3" id="text-2.9">

</div>

</div>

<div id="outline-container-2.10" class="outline-3">
<h3 id="sec-2.10"><span class="section-number-3">2.10</span> Proposition 3 </h3>
<div class="outline-text-3" id="text-2.10">

</div>

</div>

<div id="outline-container-2.11" class="outline-3">
<h3 id="sec-2.11"><span class="section-number-3">2.11</span> Definition: Idempotent </h3>
<div class="outline-text-3" id="text-2.11">

</div>

</div>

<div id="outline-container-2.12" class="outline-3">
<h3 id="sec-2.12"><span class="section-number-3">2.12</span> Theorem (uniqueness of inverses) </h3>
<div class="outline-text-3" id="text-2.12">

</div>

</div>

<div id="outline-container-2.13" class="outline-3">
<h3 id="sec-2.13"><span class="section-number-3">2.13</span> Definition: Isomorphism </h3>
<div class="outline-text-3" id="text-2.13">

</div>

</div>

<div id="outline-container-2.14" class="outline-3">
<h3 id="sec-2.14"><span class="section-number-3">2.14</span> Definition: Automorphism </h3>
<div class="outline-text-3" id="text-2.14">

</div>

</div>

<div id="outline-container-2.15" class="outline-3">
<h3 id="sec-2.15"><span class="section-number-3">2.15</span> Summary: Special properties a map f:A-&gt;B may have. </h3>
<div class="outline-text-3" id="text-2.15">

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Examples of Categories. </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> Overview </h3>
<div class="outline-text-3" id="text-3.1">


</div>

<div id="outline-container-3.1.1" class="outline-4">
<h4 id="sec-3.1.1"><span class="section-number-4">3.1.1</span> The Category END of Endomaps of Sets </h4>
<div class="outline-text-4" id="text-3.1.1">

</div>

</div>

<div id="outline-container-3.1.2" class="outline-4">
<h4 id="sec-3.1.2"><span class="section-number-4">3.1.2</span> Typical Applications of END </h4>
<div class="outline-text-4" id="text-3.1.2">

</div>

</div>

<div id="outline-container-3.1.3" class="outline-4">
<h4 id="sec-3.1.3"><span class="section-number-4">3.1.3</span> Two Subcategories of END </h4>
<div class="outline-text-4" id="text-3.1.3">

</div>

</div>

<div id="outline-container-3.1.4" class="outline-4">
<h4 id="sec-3.1.4"><span class="section-number-4">3.1.4</span> Categories of Endomaps </h4>
<div class="outline-text-4" id="text-3.1.4">

</div>

</div>

<div id="outline-container-3.1.5" class="outline-4">
<h4 id="sec-3.1.5"><span class="section-number-4">3.1.5</span> Irreflexive Graphs </h4>
<div class="outline-text-4" id="text-3.1.5">

</div>

</div>

<div id="outline-container-3.1.6" class="outline-4">
<h4 id="sec-3.1.6"><span class="section-number-4">3.1.6</span> Endomaps as Special Graphs </h4>
<div class="outline-text-4" id="text-3.1.6">

</div>

</div>

<div id="outline-container-3.1.7" class="outline-4">
<h4 id="sec-3.1.7"><span class="section-number-4">3.1.7</span> The Simpler Category SGL: Objects Are Just Maps of Sets </h4>
<div class="outline-text-4" id="text-3.1.7">

</div>

</div>

<div id="outline-container-3.1.8" class="outline-4">
<h4 id="sec-3.1.8"><span class="section-number-4">3.1.8</span> Reflexive Graphs </h4>
<div class="outline-text-4" id="text-3.1.8">

</div>

</div>

<div id="outline-container-3.1.9" class="outline-4">
<h4 id="sec-3.1.9"><span class="section-number-4">3.1.9</span> Summary of the Examples and Their General Significance </h4>
<div class="outline-text-4" id="text-3.1.9">

</div>

</div>

<div id="outline-container-3.1.10" class="outline-4">
<h4 id="sec-3.1.10"><span class="section-number-4">3.1.10</span> Retractions and Injectivity </h4>
<div class="outline-text-4" id="text-3.1.10">

</div>

</div>

<div id="outline-container-3.1.11" class="outline-4">
<h4 id="sec-3.1.11"><span class="section-number-4">3.1.11</span> Types of Structure </h4>
<div class="outline-text-4" id="text-3.1.11">

</div>

</div>

<div id="outline-container-3.1.12" class="outline-4">
<h4 id="sec-3.1.12"><span class="section-number-4">3.1.12</span> Guide </h4>
<div class="outline-text-4" id="text-3.1.12">

</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Universal Mapping Properties. </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1"><span class="section-number-3">4.1</span> Overview </h3>
<div class="outline-text-3" id="text-4.1">


</div>

<div id="outline-container-4.1.1" class="outline-4">
<h4 id="sec-4.1.1"><span class="section-number-4">4.1.1</span> Terminal Objects </h4>
<div class="outline-text-4" id="text-4.1.1">

</div>

</div>

<div id="outline-container-4.1.2" class="outline-4">
<h4 id="sec-4.1.2"><span class="section-number-4">4.1.2</span> Separating </h4>
<div class="outline-text-4" id="text-4.1.2">

</div>

</div>

<div id="outline-container-4.1.3" class="outline-4">
<h4 id="sec-4.1.3"><span class="section-number-4">4.1.3</span> Initial Object </h4>
<div class="outline-text-4" id="text-4.1.3">

</div>

</div>

<div id="outline-container-4.1.4" class="outline-4">
<h4 id="sec-4.1.4"><span class="section-number-4">4.1.4</span> Products </h4>
<div class="outline-text-4" id="text-4.1.4">

</div>

</div>

<div id="outline-container-4.1.5" class="outline-4">
<h4 id="sec-4.1.5"><span class="section-number-4">4.1.5</span> Commutative, Associative, and Identity Laws for Multiplication of Objects </h4>
<div class="outline-text-4" id="text-4.1.5">

</div>

</div>

<div id="outline-container-4.1.6" class="outline-4">
<h4 id="sec-4.1.6"><span class="section-number-4">4.1.6</span> Sums </h4>
<div class="outline-text-4" id="text-4.1.6">

</div>

</div>

<div id="outline-container-4.1.7" class="outline-4">
<h4 id="sec-4.1.7"><span class="section-number-4">4.1.7</span> Distributive Laws </h4>
<div class="outline-text-4" id="text-4.1.7">

</div>

</div>

<div id="outline-container-4.1.8" class="outline-4">
<h4 id="sec-4.1.8"><span class="section-number-4">4.1.8</span> Guide </h4>
<div class="outline-text-4" id="text-4.1.8">

</div>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Map Objects. </h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5.1" class="outline-3">
<h3 id="sec-5.1"><span class="section-number-3">5.1</span> Overview </h3>
<div class="outline-text-3" id="text-5.1">


</div>

<div id="outline-container-5.1.1" class="outline-4">
<h4 id="sec-5.1.1"><span class="section-number-4">5.1.1</span> Definition of Map Object </h4>
<div class="outline-text-4" id="text-5.1.1">

</div>

</div>

<div id="outline-container-5.1.2" class="outline-4">
<h4 id="sec-5.1.2"><span class="section-number-4">5.1.2</span> Distributivity </h4>
<div class="outline-text-4" id="text-5.1.2">

</div>

</div>

<div id="outline-container-5.1.3" class="outline-4">
<h4 id="sec-5.1.3"><span class="section-number-4">5.1.3</span> Map Objects and the Diagonal Argument </h4>
<div class="outline-text-4" id="text-5.1.3">

</div>

</div>

<div id="outline-container-5.1.4" class="outline-4">
<h4 id="sec-5.1.4"><span class="section-number-4">5.1.4</span> Universal Properties and 'Observables' </h4>
<div class="outline-text-4" id="text-5.1.4">

</div>

</div>

<div id="outline-container-5.1.5" class="outline-4">
<h4 id="sec-5.1.5"><span class="section-number-4">5.1.5</span> Guide </h4>
<div class="outline-text-4" id="text-5.1.5">

</div>

</div>

<div id="outline-container-5.1.6" class="outline-4">
<h4 id="sec-5.1.6"><span class="section-number-4">5.1.6</span> Definition: Map Object </h4>
<div class="outline-text-4" id="text-5.1.6">

</div>

</div>

<div id="outline-container-5.1.7" class="outline-4">
<h4 id="sec-5.1.7"><span class="section-number-4">5.1.7</span> Notation </h4>
<div class="outline-text-4" id="text-5.1.7">

</div>

</div>

<div id="outline-container-5.1.8" class="outline-4">
<h4 id="sec-5.1.8"><span class="section-number-4">5.1.8</span> Proposition </h4>
<div class="outline-text-4" id="text-5.1.8">

</div>

</div>

<div id="outline-container-5.1.9" class="outline-4">
<h4 id="sec-5.1.9"><span class="section-number-4">5.1.9</span> Theorem (Cantor's Diagonal Argument) </h4>
<div class="outline-text-4" id="text-5.1.9">

</div>

</div>

<div id="outline-container-5.1.10" class="outline-4">
<h4 id="sec-5.1.10"><span class="section-number-4">5.1.10</span> Definition: Chaotic </h4>
<div class="outline-text-4" id="text-5.1.10">

</div>

</div>

<div id="outline-container-5.1.11" class="outline-4">
<h4 id="sec-5.1.11"><span class="section-number-4">5.1.11</span> Definition: Admissible Notion </h4>
<div class="outline-text-4" id="text-5.1.11">

</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: GW Dean
<a href="mailto:gwdean@gmail.com">&lt;gwdean@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2013-10-09 Wed</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
